Documents/Renault_Рекламация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_Рекламация</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Заполняется автоматически перед записью нового документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктОПоврежденииСТК</Name>
					<Comment>Акт об обнаружении повреждений груза с ТК</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРекламации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_РекламацииВиды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияГруза</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассификацияОтказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КлассификацияОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестЗафактурованно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестПовреждено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестПолучено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНормоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийДилера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКоробки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТрН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТрН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоврежденноеКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредложениеИнициатора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПредложенияПоРекламациям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_РешенияПоРекламациям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_РекламацииСтатусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SAPPR_ВидЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентральныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОбъектовСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовСведений</Name>
			<Comment>Виды объектов сведений</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>Руководитель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Comment>Главный бухгалтер</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
					<Comment>Кассир</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Материально ответственное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтратегияСписанияПоДатам</Name>
					<Comment>Стратегия списания партий товаров по датам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтратегияСписанияПоСтатусам</Name>
					<Comment>Стратегия списания партий товаров по статусам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокПоставки</Name>
					<Comment>Срок поставки</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_РекламацииВиды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_РекламацииВиды</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОшибкаДокументации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Излишек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НевернаяОтгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_Рекламация/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
	
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Возврат; // доработать
	
	Если Ложь тогда
		ТабДок = Новый ТабличныйДокумент;
	КонецЕсли;

	Макет = Документы.Renault_Рекламация.ПолучитьМакет("ТОРГ2");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рекламация.Ссылка,
	|	Рекламация.ВидРекламации,
	|	Рекламация.Дата,
	|	Рекламация.ДатаДокВх,
	|	Рекламация.ДатаПолученияГруза,
	|	Рекламация.ДатаСФВх,
	|	Рекламация.ДоговорВзаиморасчетов,
	|	Рекламация.ЕдИзмерения,
	|	Рекламация.ЕдИзмеренияПлан,
	|	Рекламация.Количество КАК КоличествоФакт,
	|	Рекламация.КоличествоМестЗафактурованно,
	|	Рекламация.КоличествоМестПовреждено,
	|	Рекламация.КоличествоМестПолучено,
	|	Рекламация.КоличествоПлан,
	|	Рекламация.КонтрагентГрузоотправитель,
	|	ПРЕДСТАВЛЕНИЕ(Рекламация.Номенклатура.НаименованиеПолное) КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(Рекламация.НоменклатураПлан.НаименованиеПолное) КАК НоменклатураПлан,
	|	Рекламация.НомерДокВх,
	|	Рекламация.НомерСФвх,
	|	Рекламация.Организация,
	|	Рекламация.СкладПолучатель,
	|	Рекламация.Сумма,
	|	Рекламация.СуммаПлан,
	|	Рекламация.ТОРГ2_ЗаключениеКомиссии,
	|	Рекламация.ТОРГ2_ОписаниеДефектов,
	|	Рекламация.ТОРГ2_РешениеРуководителя,
	|	Рекламация.ТОРГ2_СостояниеМаркировки,
	|	Рекламация.ТОРГ2_СостояниеУпаковки,
	|	Рекламация.ТОРГ2_УсловияХранения,
	|	Рекламация.ТранспортнаяКомпания,
	|	Рекламация.ФИОВодителя,
	|	ВЫБОР
	|		КОГДА Рекламация.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ Рекламация.Сумма / Рекламация.Количество
	|	КОНЕЦ КАК Цена,
	|	Рекламация.КоличествоМестЗафактурованно - Рекламация.КоличествоМестПолучено КАК КоличествоМестРасхождение,
	|	Рекламация.ЕдИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдИзмеренияКодПоОКЕИ,
	|	ВЫБОР
	|		КОГДА Рекламация.КоличествоПлан = 0
	|			ТОГДА 0
	|		ИНАЧЕ Рекламация.СуммаПлан / Рекламация.КоличествоПлан
	|	КОНЕЦ КАК ЦенаСНДСПлан,
	|	Рекламация.НоменклатураПлан.Артикул КАК АртикулПлан,
	|	Рекламация.Номенклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА Рекламация.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ Рекламация.Сумма / Рекламация.Количество
	|	КОНЕЦ КАК ЦенаСНДС,
	|	Рекламация.ЕдИзмеренияПлан.ЕдиницаПоКлассификатору.Код КАК ЕдИзмеренияПланКодПоОКЕИ,
	|	ВЫБОР
	|		КОГДА Рекламация.КоличествоПлан - Рекламация.Количество <= 0
	|			ТОГДА 0
	|		ИНАЧЕ Рекламация.КоличествоПлан - Рекламация.Количество
	|	КОНЕЦ КАК КоличествоНедостача,
	|	ВЫБОР
	|		КОГДА Рекламация.Количество - Рекламация.КоличествоПлан <= 0
	|			ТОГДА 0
	|		ИНАЧЕ Рекламация.Количество - Рекламация.КоличествоПлан
	|	КОНЕЦ КАК КоличествоИзлишки,
	|	ПРЕДСТАВЛЕНИЕ(Рекламация.СкладПолучатель.МОЛ.Наименование) КАК ОтветственноеЛицо
	|ПОМЕСТИТЬ ВремТЗ
	|ИЗ
	|	Документ.Renault_Рекламация КАК Рекламация
	|ГДЕ
	|	Рекламация.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТЗ.Ссылка,
	|	ВремТЗ.ВидРекламации,
	|	ВремТЗ.Дата,
	|	ВремТЗ.ДатаДокВх,
	|	ВремТЗ.ДатаПолученияГруза,
	|	ВремТЗ.ДатаСФВх,
	|	ВремТЗ.ДоговорВзаиморасчетов,
	|	ВремТЗ.ЕдИзмерения,
	|	ВремТЗ.ЕдИзмеренияПлан,
	|	ВремТЗ.КоличествоФакт,
	|	ВремТЗ.КоличествоМестЗафактурованно,
	|	ВремТЗ.КоличествоМестПовреждено,
	|	ВремТЗ.КоличествоМестПолучено,
	|	ВремТЗ.КоличествоПлан,
	|	ВремТЗ.КонтрагентГрузоотправитель,
	|	ВремТЗ.Номенклатура,
	|	ВремТЗ.НоменклатураПлан,
	|	ВремТЗ.НомерДокВх,
	|	ВремТЗ.НомерСФвх,
	|	ВремТЗ.Организация,
	|	ВремТЗ.СкладПолучатель,
	|	ВремТЗ.Сумма,
	|	ВремТЗ.СуммаПлан,
	|	ВремТЗ.ТОРГ2_ЗаключениеКомиссии,
	|	ВремТЗ.ТОРГ2_ОписаниеДефектов,
	|	ВремТЗ.ТОРГ2_РешениеРуководителя,
	|	ВремТЗ.ТОРГ2_СостояниеМаркировки,
	|	ВремТЗ.ТОРГ2_СостояниеУпаковки,
	|	ВремТЗ.ТОРГ2_УсловияХранения,
	|	ВремТЗ.ТранспортнаяКомпания,
	|	ВремТЗ.ФИОВодителя,
	|	ВремТЗ.КоличествоМестРасхождение,
	|	ВремТЗ.ЕдИзмеренияКодПоОКЕИ,
	|	ВремТЗ.ЦенаСНДСПлан,
	|	ВремТЗ.АртикулПлан,
	|	ВремТЗ.Артикул,
	|	ВремТЗ.ЦенаСНДС,
	|	ВремТЗ.ЕдИзмеренияПланКодПоОКЕИ,
	|	ВремТЗ.КоличествоНедостача,
	|	ВремТЗ.КоличествоИзлишки,
	|	ВремТЗ.КоличествоИзлишки * ВремТЗ.ЦенаСНДС КАК СуммаИзлишки,
	|	ВремТЗ.КоличествоНедостача * ВремТЗ.ЦенаСНДС КАК СуммаНедостача,
	|	ВремТЗ.ОтветственноеЛицо
	|ИЗ
	|	ВремТЗ КАК ВремТЗ";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Если Выборка.Следующий() тогда
		
		ПервыйЛист = Макет.ПолучитьОбласть("ПервыйЛист");
		
		ПервыйЛист.Параметры.Заполнить(Выборка);
		
		//Дополняем не достающие параметры
		КодОКДП = Выборка.Организация.КодПоОКДП;
		КодОКПО = Выборка.Организация.КодПоОКПО;
		ПервыйЛист.Параметры.КодОКДП = КодОКДП;
		ПервыйЛист.Параметры.КодОКПО = КодОКПО;
		
		
		//Получаем руководителя и главбуха.
		Руководитель = дкОтветственноеЛицо(Выборка.Ссылка,Перечисления.ВидыОбъектовСведений.Руководитель);
		ГлБух = дкОтветственноеЛицо(Выборка.Ссылка,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
		
		ПервыйЛист.Параметры.ДолжностьРуководителя = Руководитель.РуководительДолжность;
		ПервыйЛист.Параметры.ФИОРуководителя = Руководитель.РуководительПредставление;
		
		СтруктураПредставления1=Новый Структура(
		"Наименование,АдресЮридический,ТелефонРабочий,Факс","",,"", "тел.: ","факс: ");
		
		СтруктураПредставления2 = Новый Структура("АДРЕСФАКТИЧЕСКИЙ","");
		
		СтруктураПредставления3=Новый Структура(
		"Наименование,АДРЕСФАКТИЧЕСКИЙ,ТелефонРабочий,Факс", "",,"", "тел.: ","факс: ");
		
		СтруктураТолькоНаименование=Новый Структура("Наименование","");
		
		ПредставлениеОрганизации = спПолучитьПредставление(Выборка.Организация,СтруктураПредставления1);
		ПервыйЛист.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
		
		//Преобразуем номер документа из внутреннего в печатный
		ПервыйЛист.Параметры.НомерДокумента = дкПолучитьНомерДляПечати(Выборка.Ссылка, Истина);
		
		//Нужно получить адрес склада получателя для места приемки
		ПервыйЛист.Параметры.МестоПриемки = спПолучитьПредставление(Выборка.СкладПолучатель.Подразделение,СтруктураПредставления2);
		
		//Проставляем накладную
		ПредставлениеНакладной = "товарная накладная №" + СокрЛП(Выборка.НомерДокВх) + " от " + формат(Выборка.ДатаДокВх, "ДФ=dd.MM.yyyy");
		ПервыйЛист.Параметры.ПредставлениеНакладной = ПредставлениеНакладной;
		
		//Отрабатываем грузоотправителя
		ПервыйЛист.Параметры.ПредставлениеГрузоотправителя = спПолучитьПредставление(Выборка.КонтрагентГрузоотправитель,СтруктураПредставления3);
		ПервыйЛист.Параметры.ГрузоотправительКратко = спПолучитьПредставление(Выборка.КонтрагентГрузоотправитель,СтруктураТолькоНаименование);
		
		ПервыйЛист.Параметры.НомерДоговора = Выборка.ДоговорВзаиморасчетов.НомерДоговора;
		ПервыйЛист.Параметры.ДатаДоговора = Выборка.ДоговорВзаиморасчетов.ДатаНачала;
		
		ТабДок.Вывести(ПервыйЛист);
		
		//Формируем второй лист
		ВторойЛист = Макет.ПолучитьОбласть("ЛистВторойШапка");
		ВторойЛист.Параметры.Заполнить(Выборка);
		
		ТабДок.Вывести(ВторойЛист);
		
		//Теперь нужно вывести количество номенклатуры по документу поставки
		ЛинияТаблицы = Макет.ПолучитьОбласть("ЛистВторойСтрока");
		ЛинияТаблицы.Параметры.Заполнить(Выборка);
		
		ТабДок.Вывести(ЛинияТаблицы);
		
		//Теперь нужно выводить до конца листа пустышки
		ЛинияТаблицыПустышка = Макет.ПолучитьОбласть("ЛистВторойСтрокаПустышка");
		ЗакрытиеТаблицы = Макет.ПолучитьОбласть("ЛистВторойСтрокаЗакрытиеТаблицы");
		
		Пока Истина Цикл
			
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(ЛинияТаблицыПустышка);
			МассивСтрок.Добавить(ЗакрытиеТаблицы);
			
			Если ТабДок.ПроверитьВывод(МассивСтрок) тогда
				
				ТабДок.Вывести(ЛинияТаблицыПустышка);
				
			Иначе
				
				ТабДок.Вывести(ЗакрытиеТаблицы);
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//Разделяем страницы
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Вывод третьего листа
		ТретийЛист = Макет.ПолучитьОбласть("ЛистТретийШапка");
		
		ТретийЛист.Параметры.Заполнить(Выборка);
		
		ТабДок.Вывести(ТретийЛист);
		
		ЛинияТаблицы = Макет.ПолучитьОбласть("ЛистТретийСтрока");
		
		//Теперь нужно выводить строки таблицы расхождений
		Если Выборка.ВидРекламации = Перечисления.Renault_РекламацииВиды.Излишек
			или Выборка.ВидРекламации = Перечисления.Renault_РекламацииВиды.Недостача тогда
			
			ЛинияТаблицы.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ЛинияТаблицы);
			
		ИначеЕсли Выборка.ВидРекламации = Перечисления.Renault_РекламацииВиды.НевернаяОтгрузка тогда
			
			ЛинияТаблицы = Макет.ПолучитьОбласть("ЛистТретийСтрока");
			
			//В пересорт идут две строки, поэтому будем делать две строки. При этом заполняем в ручную
			//Сначала факт - это будут излишки
			ЛинияТаблицы.Параметры.Артикул = Выборка.Артикул;
			ЛинияТаблицы.Параметры.КоличествоФакт = Выборка.КоличествоФакт;
			ЛинияТаблицы.Параметры.ЦенаСНДС = Выборка.ЦенаСНДС;
			ЛинияТаблицы.Параметры.Сумма = Выборка.Сумма;
			ЛинияТаблицы.Параметры.КоличествоИзлишки = Выборка.КоличествоФакт;
			ЛинияТаблицы.Параметры.СуммаИзлишки = Выборка.Сумма;
			ЛинияТаблицы.Параметры.КоличествоНедостача = "";
			ЛинияТаблицы.Параметры.СуммаНедостача = "";
			
			ТабДок.Вывести(ЛинияТаблицы);
			
			ЛинияТаблицы = Макет.ПолучитьОбласть("ЛистТретийСтрока");
			
			//Теперь план - это будет недостача
			ЛинияТаблицы.Параметры.Артикул = Выборка.АртикулПлан;
			ЛинияТаблицы.Параметры.КоличествоФакт = 0;
			ЛинияТаблицы.Параметры.ЦенаСНДС = 0;
			ЛинияТаблицы.Параметры.Сумма = 0;
			ЛинияТаблицы.Параметры.КоличествоИзлишки = "";
			ЛинияТаблицы.Параметры.СуммаИзлишки = "";
			ЛинияТаблицы.Параметры.КоличествоНедостача = Выборка.КоличествоПлан;
			ЛинияТаблицы.Параметры.СуммаНедостача = Выборка.СуммаПлан;
			
			ТабДок.Вывести(ЛинияТаблицы);
			
		ИначеЕсли Выборка.ВидРекламации = Перечисления.Renault_РекламацииВиды.Брак тогда
			
			ЛинияТаблицы = Макет.ПолучитьОбласть("ЛистТретийСтрока");
			ЛинияТаблицы.Параметры.Артикул = Выборка.Артикул;
			ЛинияТаблицы.Параметры.КоличествоФакт = Выборка.КоличествоПлан;
			ЛинияТаблицы.Параметры.ЦенаСНДС = Выборка.ЦенаСНДСПлан;
			ЛинияТаблицы.Параметры.Сумма = Выборка.СуммаПлан;
			ЛинияТаблицы.Параметры.КоличествоБой = Выборка.КоличествоФакт;
			ЛинияТаблицы.Параметры.СуммаБой = Выборка.Сумма;
			
			ТабДок.Вывести(ЛинияТаблицы);
			
		ИначеЕсли Выборка.ВидРекламации = Перечисления.Renault_РекламацииВиды.Брак тогда
			
			ЛинияТаблицы = Макет.ПолучитьОбласть("ЛистТретийСтрока");
			ЛинияТаблицы.Параметры.Артикул = Выборка.Артикул;
			ЛинияТаблицы.Параметры.КоличествоФакт = Выборка.КоличествоПлан;
			ЛинияТаблицы.Параметры.ЦенаСНДС = Выборка.ЦенаСНДСПлан;
			ЛинияТаблицы.Параметры.Сумма = Выборка.СуммаПлан;
			ЛинияТаблицы.Параметры.КоличествоБрак = Выборка.КоличествоФакт;
			ЛинияТаблицы.Параметры.СуммаБрак = Выборка.Сумма;
			
			ТабДок.Вывести(ЛинияТаблицы);
			
		КонецЕсли;
		
		//Теперь нужно выводить до конца листа пустышки
		ЛинияТаблицыПустышка = Макет.ПолучитьОбласть("ЛистТретийСтрокаПустышка");
		ЗакрытиеТаблицы = Макет.ПолучитьОбласть("ЛистТретийЗакрытиеТаблицы");
		
		Пока Истина Цикл
			
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(ЛинияТаблицыПустышка);
			МассивСтрок.Добавить(ЗакрытиеТаблицы);
			
			Если ТабДок.ПроверитьВывод(МассивСтрок) тогда
				
				ТабДок.Вывести(ЛинияТаблицыПустышка);
				
			Иначе
				
				ТабДок.Вывести(ЗакрытиеТаблицы);
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//Разделяем страницы
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Начинаем формировать подписи
		Подписи = Макет.ПолучитьОбласть("Подписи");
		
		Подписи.Параметры.Заполнить(Выборка);
		
		//Нужно заполнить председателя, членов комиссии и представителя
		Запрос.Текст = "ВЫБРАТЬ
		|	РекламацияУчастникиКомиссии.ТипУчастника,
		|	РекламацияУчастникиКомиссии.Участник,
		|	РекламацияУчастникиКомиссии.Должность
		|ИЗ
		|	Документ.Renault_Рекламация.УчастникиКомиссии КАК РекламацияУчастникиКомиссии
		|ГДЕ
		|	РекламацияУчастникиКомиссии.Ссылка В(&Ссылка)";
		ТЗУчастников = Запрос.Выполнить().Выгрузить();
		
		Председатель = ТЗУчастников.Найти("Председатель комиссии");
		
		Если НЕ Председатель = неопределено тогда
			Подписи.Параметры.ДолжностьПредседателя = Председатель.Должность;
			Подписи.Параметры.ПредседательКомиссии = Председатель.Участник;
		КонецЕсли;
		
		Участник1 = ТЗУчастников.Найти("Участник комисии 1");
		
		Если НЕ Участник1 = неопределено тогда
			Подписи.Параметры.ДолжностьУчастникаКомиссии1 = Участник1.Должность;
			Подписи.Параметры.УчастникКомиссии1 = Участник1.Участник;
		КонецЕсли;
		
		Участник2 = ТЗУчастников.Найти("Участник комисии 2");
		
		Если НЕ Участник2 = неопределено тогда
			Подписи.Параметры.ДолжностьУчастникаКомиссии2 = Участник2.Должность;
			Подписи.Параметры.УчастникКомиссии2 = Участник2.Участник;
		КонецЕсли;
		
		Участник3= ТЗУчастников.Найти("Участник комисии 3");
		
		Если НЕ Участник3 = неопределено тогда
			Подписи.Параметры.ДолжностьУчастникаКомиссии3 = Участник3.Должность;
			Подписи.Параметры.УчастникКомиссии3 = Участник3.Участник;
		КонецЕсли;
		
		Подписи.Параметры.ГлавныйБухгалтер = ГлБух.ГлавныйБухгалтерПредставление;
		ТабДок.Вывести(Подписи);
		
	КонецЕсли;
КонецПроцедуры

Функция НайтиEmailСотрудника(Сотрудник) Экспорт

	// Ищем e-mail сотрудника
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда Возврат ""; КонецЕсли;	
	
	НЗ_КИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НЗ_КИ.Отбор.Объект.Установить(Сотрудник);
	НЗ_КИ.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	НЗ_КИ.Прочитать();
	
	Email="";
	Для каждого КИ Из НЗ_КИ Цикл
		Если СтрЧислоВхождений(НРег(Строка(КИ.Вид)),"рабочий")>0 Тогда Email=КИ.Представление; Прервать; КонецЕсли;
		Email=КИ.Представление;
	КонецЦикла;

	Возврат Email;
	
КонецФункции

Функция ПолучитьСИТ(ДилерскийЦентр) Экспорт

	СИТ = "";
	
	Если Не ЗначениеЗаполнено(ДилерскийЦентр) ИЛИ Не ЗначениеЗаполнено(ДилерскийЦентр.BIR) Тогда Возврат СИТ; КонецЕсли;
	
	// Проверим корректность BIR, корректный BIR имеет вид ХХХХХХХХ-ХХХ
	BIR = СокрЛП(ДилерскийЦентр.BIR);
	КорректныйBIR = Истина;
	Если ПустаяСтрока(BIR) 
		ИЛИ СтрДлина(BIR)<>12 
		ИЛИ Найти(BIR,"-")<>9 
		Тогда 
		
		Возврат СИТ; 
	КонецЕсли;
	
	СтрокаЦифр = "0123456789";
	Для Сч=1 По СтрДлина(BIR) Цикл
		Если Сч<>9 Тогда
			КорректныйBIR = Найти(СтрокаЦифр,Сред(BIR,Сч,1))<>Неопределено;
		КонецЕсли;
		
		Если Не КорректныйBIR Тогда Возврат СИТ; КонецЕсли;
	КонецЦикла;

	Попытка
		НомерПунктаДоставки = Строка(Число(Прав(BIR,3)));
		BIRОбщий = Лев(BIR,8);
	    СИТ = НомерПунктаДоставки+BIRОбщий;
	Исключение
	КонецПопытки;
	
	Возврат СИТ;
	
КонецФункции // ПолучитьСИТ()


#КонецЕсли
